Revit 2024 API
ParameterTypeId.EnergyAnalysisSkylightWidth Property
 "Skylight Width & Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisSkylightWidth { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisSkylightWidth As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisSkylightWidth {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace